DataProcessors/Renault_Highcharts.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>Renault_Highcharts</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подзаголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Серии</Name>
					<Comment>Массив (СтрокаВнутр)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АктивнаяТочка</Name>
					<Comment>Структура(ИмяСерии,ИмяТочки,Значение) (СтрокаВнутр)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/Renault_Highcharts/Forms/Пример/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Заголовок="Пример графика";
	Объект.Подзаголовок="Текст подзаголовка";
	Обработки.Renault_Highcharts.ТипыГрафика(Элементы.Тип.СписокВыбора);
	Объект.Тип="pie";
	ЗаполнитьСерии();
	ОбновитьГрафик();
КонецПроцедуры

Процедура ОбновитьГрафик() html=РеквизитФормыВЗначение("Объект").ПолучитьHTML() КонецПроцедуры	

&НаКлиенте
Процедура ТипПриИзменении(Элемент) ОбновитьГрафик() КонецПроцедуры

Процедура ЗаполнитьСерии()
	Менеджер=Обработки.Renault_Highcharts;
	ИмяСерии="Бренд";
	АктивнаяТочка=Менеджер.НоваяТочка(ИмяСерии,"Chrome",24.03);
	Менеджер.УстановитьАктивнуюТочку(Объект,АктивнаяТочка);
	
	Точки=Новый Массив;
	Точки.Добавить(Менеджер.НоваяТочка(ИмяСерии,"Microsoft Internet Explorer",56.33));
	Точки.Добавить(АктивнаяТочка);
	Точки.Добавить(Менеджер.НоваяТочка(ИмяСерии,"Firefox",10.38));
	Точки.Добавить(Менеджер.НоваяТочка(ИмяСерии,"Safari",4.77));
	Точки.Добавить(Менеджер.НоваяТочка(ИмяСерии,"Opera",0.91));
	Точки.Добавить(Менеджер.НоваяТочка(ИмяСерии,"Proprietary or Undetectable",0.2));

	Серия=Новый Структура("ИмяСерии,Точки",ИмяСерии,Точки);
	
	Серии=Новый Массив;
	Серии.Добавить(Серия);
	
	Объект.Серии=ЗначениеВСтрокуВнутр(Серии);
КонецПроцедуры
